{
    "format": "layers-model",
    "generatedBy": "keras v2.15.0",
    "convertedBy": "TensorFlow.js Converter v3.18.0",
    "modelTopology": {
        "keras_version": "2.15.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "ASL_Landmarks_MLP",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                63
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "landmarks"
                        },
                        "name": "landmarks",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 512,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": {
                                "module": "keras.regularizers",
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 9.999999747378752e-05
                                },
                                "registered_name": null
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense",
                        "inbound_nodes": [
                            [
                                [
                                    "landmarks",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization",
                        "inbound_nodes": [
                            [
                                [
                                    "dense",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.4,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 256,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": {
                                "module": "keras.regularizers",
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 9.999999747378752e-05
                                },
                                "registered_name": null
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_1",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_1",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_1",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_1",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.35,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_1",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 128,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": {
                                "module": "keras.regularizers",
                                "class_name": "L1L2",
                                "config": {
                                    "l2": 9.999999747378752e-05
                                },
                                "registered_name": null
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_2",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_2",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_2",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_2",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_2",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.3,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_2",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 26,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_3",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "landmarks",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "dense_3",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Custom>Adam",
                "config": {
                    "name": "Adam",
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "jit_compile": false,
                    "is_legacy_optimizer": false,
                    "learning_rate": 0.0001250000059371814,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization/gamma",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/beta",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_mean",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_variance",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_mean",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_variance",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/gamma",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/beta",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/moving_mean",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/moving_variance",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        63,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        512,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [
                        256,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        128,
                        26
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        26
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}