{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "asl_model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 126], "dtype": "float32", "sparse": false, "ragged": false, "name": "asl_input"}, "name": "asl_input", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bi_1", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}, "name": "bi_1", "inbound_nodes": [[["asl_input", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "ln_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ln_1", "inbound_nodes": [[["bi_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["ln_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bi_2", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}, "name": "bi_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "ln_2", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ln_2", "inbound_nodes": [[["bi_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["ln_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_256", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_256", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_d1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_d1", "inbound_nodes": [[["dense_256", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_128", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_128", "inbound_nodes": [[["dropout_d1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_output", "trainable": true, "dtype": "float32", "units": 35, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_output", "inbound_nodes": [[["dense_128", 0, 0, {}]]]}], "input_layers": [["asl_input", 0, 0]], "output_layers": [["dense_output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bi_1/forward_lstm/lstm_cell/kernel", "shape": [126, 512], "dtype": "float32"}, {"name": "bi_1/forward_lstm/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bi_1/forward_lstm/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "bi_1/backward_lstm/lstm_cell/kernel", "shape": [126, 512], "dtype": "float32"}, {"name": "bi_1/backward_lstm/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bi_1/backward_lstm/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "bi_2/forward_lstm_1/lstm_cell/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "bi_2/forward_lstm_1/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bi_2/forward_lstm_1/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "bi_2/backward_lstm_1/lstm_cell/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "bi_2/backward_lstm_1/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bi_2/backward_lstm_1/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_128/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_128/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_256/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_256/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_output/kernel", "shape": [128, 35], "dtype": "float32"}, {"name": "dense_output/bias", "shape": [35], "dtype": "float32"}, {"name": "ln_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "ln_1/beta", "shape": [256], "dtype": "float32"}, {"name": "ln_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "ln_2/beta", "shape": [256], "dtype": "float32"}]}]}